src/main/resources/resquetGenerado.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:ser="http://services.booking.rumbonet.riu.com" xmlns:dtos="http://dtos.booking.rumbonet.riu.com"
                  xmlns:ser1="http://services.common.rumbonet.riu.com">
    <soapenv:Header/>
    <soapenv:Body>
        <ser:recuperarTablaPreciosRB>
            <ser:in0>
                <dtos:codigoAccesoUsuario>DIRECTO</dtos:codigoAccesoUsuario>
                <dtos:codigoAmbito>DIR</dtos:codigoAmbito>
                <dtos:codigoPaisAmbito>US</dtos:codigoPaisAmbito>
                <dtos:codigoRegimen>SH</dtos:codigoRegimen>
                <dtos:fechaEntrada>2023-11-30T00:00:00.000+00:00</dtos:fechaEntrada>
                <dtos:fechaSalida>2023-12-9T00:00:00.000+00:00</dtos:fechaSalida>
                <dtos:listaHabitaciones>
                    <dtos:listaHabitaciones>
                        <dtos:DispHabitacionDto>
                            <dtos:listaedades>

                            </dtos:listaedades>
                            <dtos:numeroAdultos>2</dtos:numeroAdultos>
                            <dtos:numeroBabies>0</dtos:numeroBabies>
                            <dtos:numeroInfants>0</dtos:numeroInfants>
                        </dtos:DispHabitacionDto>
                    </dtos:listaHabitaciones>
                </dtos:listaHabitaciones>
                <dtos:listaTipoHabitaciones>
                    <ser1:string>DLT</ser1:string>
                </dtos:listaTipoHabitaciones>
                <dtos:listaHoteles>
                    <dtos:listaHoteles>
                        <ser1:int>3502</ser1:int>
                    </dtos:listaHoteles>
                </dtos:listaHoteles>
                <dtos:numeroAdultos>2</dtos:numeroAdultos>
                <dtos:numeroBabies>0</dtos:numeroBabies>
                <dtos:numeroHabitaciones>1</dtos:numeroHabitaciones>
                <dtos:numeroInfants>0</dtos:numeroInfants>
            </ser:in0>
        </ser:recuperarTablaPreciosRB>
    </soapenv:Body>
</soapenv:Envelope>